In [1]:
!pip install selenium

Requirement already satisfied: selenium in c:\users\tusha\anaconda3\lib\site-packages (4.9.1)
Requirement already satisfied: trio-websocket~=0.9 in c:\users\tusha\anaconda3\lib\site-packages (from selenium) (0.10.2)
Requirement already satisfied: trio~=0.17 in c:\users\tusha\anaconda3\lib\site-packages (from selenium) (0.22.0)
Requirement already satisfied: certifi>=2021.10.8 in c:\users\tusha\anaconda3\lib\site-packages (from selenium) (2022.9.14)
Requirement already satisfied: urllib3[socks]<3,>=1.26 in c:\users\tusha\anaconda3\lib\site-packages (from selenium) (1.26.11)
Requirement already satisfied: sortedcontainers in c:\users\tusha\anaconda3\lib\site-packages (from trio~=0.17->selenium) (2.4.0)
Requirement already satisfied: outcome in c:\users\tusha\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: cffi>=1.14 in c:\users\tusha\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.15.1)
Requirement already satisfied: attrs>=19.2.0 in c:\users\tusha\anaconda3\lib\site-packages (from trio~=0.17->selenium) (21.4.0)
Requirement already satisfied: sniffio in c:\users\tusha\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: exceptiongroup>=1.0.0rc9 in c:\users\tusha\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.1.1)
Requirement already satisfied: async-generator>=1.9 in c:\users\tusha\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.10)
Requirement already satisfied: idna in c:\users\tusha\anaconda3\lib\site-packages (from trio~=0.17->selenium) (3.3)
Requirement already satisfied: wsproto>=0.14 in c:\users\tusha\anaconda3\lib\site-packages (from trio-websocket~=0.9->selenium) (1.2.0)
Requirement already satisfied: PySocks!=1.5.7,<2.0,>=1.5.6 in c:\users\tusha\anaconda3\lib\site-packages (from urllib3[socks]<3,>=1.26->selenium) (1.7.1)
Requirement already satisfied: pycparser in c:\users\tusha\anaconda3\lib\site-packages (from cffi>=1.14->trio~=0.17->selenium) (2.21)
Requirement already satisfied: h11<1,>=0.9.0 in c:\users\tusha\anaconda3\lib\site-packages (from wsproto>=0.14->trio-websocket~=0.9->selenium) (0.14.0)

Q1. Write a python program to scrape data for “Data Analyst” Job position in “Bangalore” location. You
have to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10
jobs data.

In [1]:
import selenium 
import pandas as pd
from selenium import webdriver 
import warnings 
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [3]:
#connecting to the driver
driver = webdriver.Chrome(r'chromedriver.exe')

In [4]:
#opening the naukri page on automated chrome browser
driver.get("https://www.naukri.com/")

In [5]:
#Entering designation and location as required in the question
designation = driver.find_element(By.CLASS_NAME,"suggestor-input")

In [6]:
designation.send_keys("Data Analyst")

In [7]:
location = driver.find_element(By.XPATH,"/html/body/div[1]/div[7]/div/div/div[5]/div/div/div/div[1]/div/input")
location.send_keys('Bangalore')

In [8]:
search = driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [9]:
job_title = []
job_location = []
company_name = []
experience_required = []

In [10]:
#Scraping job title
title_tags = driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in title_tags[0:10]:
    title = i.text
    job_title.append(title)
    
    
    
#scraping the job location
location_tags = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in location_tags[0:10]:
    location = i.text
    job_location.append(location)
    
    
#scraping company name
company_tags = driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company = i.text 
    company_name.append(company)
    
    
#scraping experience
experience_tags = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for i in experience_tags[0:10]:
    exp = i.text
    experience_required.append(exp)

In [11]:
print(len(job_title),len(job_location),len(company_name),len(experience_required))

10 10 10 10

In [12]:
import pandas as pd
df = pd.DataFrame({'Title':job_title,'Location':job_location,'Company_Name':company_name,'Experience':experience_required})

In [13]:
df

,Title,Location,Company_Name,Experience
0,Tech Data Analyst,"Hybrid - Bangalore/ Bengaluru, Karnataka, Gurg...",Wipro,3-6 Yrs
1,Data Analyst,Bangalore/Bengaluru,Brunel,4-6 Yrs
2,Celonis & Salesforce Data Analyst,"Bangalore/Bengaluru, Chennai",Hitachi Energy,3-6 Yrs
3,Knowledge Data Analyst,Bangalore/Bengaluru,SAP,4-6 Yrs
4,Data Analyst,"Bangalore/Bengaluru, Kolkata, Hyderabad/Secund...",Tata Consultancy Services (TCS),5-10 Yrs
5,Data Analyst,"Bangalore/ Bengaluru, Karnataka",Artech,5-8 Yrs
6,Data Analyst (Bangalore),Bangalore/Bengaluru,Krazy Mantra,7-12 Yrs
7,Insight Data Analyst,"Bangalore/ Bengaluru, Karnataka, Noida, Uttar ...",Vuca Consulting,5-10 Yrs
8,Data Analyst,Bangalore/Bengaluru,Loyalytics Consulting,4-9 Yrs
9,Data Analyst,Bangalore/Bengaluru,Clairvoyant India Pvt. Ltd,3-6 Yrs

Q2. Write a python program to scrape data for “Data Scientist” Job position in “Bangalore” location. You
have to scrape the job-title, job-location, company_name. You have to scrape first 10 jobs data.
This task will be done in following steps:

In [14]:
#connect the driver
driver = webdriver.Chrome(r'chromedriver.exe')

In [15]:
#opening the naukri page on automated chrome browser
driver.get("https://www.naukri.com/")

In [16]:
designation1 = driver.find_element(By.XPATH,'//input[@class="suggestor-input "]')
designation1.send_keys("Data Scientist")

In [17]:
location1 = driver.find_element(By.XPATH,'/html/body/div[1]/div[7]/div/div/div[5]/div/div/div/div[1]/div/input')
location1.send_keys("Bangalore")

In [18]:
search1 = driver.find_element(By.XPATH,'/html/body/div[1]/div[7]/div/div/div[6]')
search1.click()

In [19]:
job_title1 = []
job_location1 = []
company_name1 = []

In [20]:
#Scraping job title
title_tags = driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in title_tags[0:10]:
    title = i.text
    job_title1.append(title)
    
    
    
#scraping the job location
location_tags = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in location_tags[0:10]:
    location = i.text
    job_location1.append(location)
    
    
#scraping company name
company_tags = driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company = i.text 
    company_name1.append(company)

In [21]:
print(len(job_title1),len(job_location1),len(company_name1))

10 10 10

In [22]:
df1 = pd.DataFrame({"Title":job_title1,"Location":job_location1,"Company_Name":company_name1})

In [23]:
df1

,Title,Location,Company_Name
0,Permanent Opportunity - Data Scientist(Snaplog...,"Hybrid - Bangalore/Bengaluru, Kolkata, Hyderab...",Deloitte
1,Analystics & Modeling Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture
2,Machine Learning (AI) Architect,"Bangalore/Bengaluru, Kolkata, Mumbai, New Delh...",Persistent
3,Data Scientist,Bangalore/Bengaluru,Ericsson
4,Data Scientist,Bangalore/Bengaluru,Ericsson
5,Staff Data Scientist,Bangalore/Bengaluru,Walmart
6,Data Scientist,"Bangalore/ Bengaluru, Karnataka",Tata Consultancy Services (TCS)
7,Senior Data Scientist,Bangalore/Bengaluru,Walmart
8,Data Scientist,Bangalore/Bengaluru,Walmart
9,Hiring For Data Scientist,"Hybrid - Bangalore/ Bengaluru, Karnataka, Hyde...",Tata Consultancy Services (TCS)

Q3. In this question you have to scrape data using the filters available on the webpage

In [12]:
#connecting to the driver
driver2 = webdriver.Chrome(r'chromedriver.exe')

In [13]:
#opening the naukri page on automated chrome browser
driver2.get("https://www.naukri.com/")

In [15]:
designation2 = driver2.find_element(By.XPATH,'//input[@class="suggestor-input "]')
designation2.send_keys("Data Scientist")

In [16]:
search2 = driver2.find_element(By.XPATH,'//div[@class="qsbSubmit"]')
search2.click()

In [17]:
location2 = driver2.find_element(By.XPATH,'/html/body/div[1]/div[4]/div/div/section[1]/div[2]/div[5]/div[2]/div[2]/label/p/span[1]')
location2.click()

In [18]:
salary2 = driver2.find_element(By.XPATH,'/html/body/div[1]/div[4]/div/div/section[1]/div[2]/div[6]/div[2]/div[2]/label/p/span[1]')
salary2.click()

In [19]:
job_title2 = []
job_location2 = []
company_name2 = []
experience_required2 = []

In [21]:
#scrapping the job titles 
title2 = driver2.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in title2[0:10]:
    titles = i.text
    job_title2.append(titles)
    
#scrapping job locations    
loc2 = driver2.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in loc2[0:10]:
    locs = i.text
    job_location2.append(locs)

    
#scrapping company names
comp2 = driver2.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in comp2[0:10]:
    comps = i.text
    company_name2.append(comps)
    
    
#scrapping the requires experience
req_exp =  driver2.find_elements(By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for i in req_exp[0:10]:
    reqexp = i.text 
    experience_required2.append(reqexp)

In [22]:
print(len(job_title2),len(job_location2),len(company_name2),len(experience_required2))

10 10 10 10

In [25]:
df2 = pd.DataFrame({"Title":job_title2,"Location":job_location2,"Company_Name":company_name2,"Experience_required":experience_required2})

In [26]:
df2

,Title,Location,Company_Name,Experience_required
0,Junior Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Analytos,0-2 Yrs
1,Data Scientist,"Gurgaon/Gurugram, Bangalore/Bengaluru",Blackbuck,3-7 Yrs
2,Data Scientist,Noida,Jubilant Ingrevia Limited,3-8 Yrs
3,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Analytos,2-4 Yrs
4,Python and ML Trainer,"Hyderabad/Secunderabad, New Delhi, Pune, Gurga...",Thescholar,3-8 Yrs
5,Data Scientist,Delhi / NCR,Tata Consultancy Services (TCS),7-12 Yrs
6,Intern,Gurgaon/Gurugram,Tower Research Capital,0-1 Yrs
7,Data Scientist,Noida,Innovaccer,2-4 Yrs
8,Lead Assistant Manager,Gurgaon/Gurugram,EXL,2-6 Yrs
9,Junior Data Scientist,"Gurgaon/Gurugram, United States (USA), Bulgaria",Adidas,1-6 Yrs

Q4. Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:
    
    1. Brand
    
    2. Product Description
    
    3. Price

In [2]:
#connecting to the driver
driver3 = webdriver.Chrome(r'chromedriver.exe')

In [3]:
#opening the flipkart page on automated chrome browser
driver3.get("https://www.flipkart.com/")

In [4]:
cancle = driver3.find_element(By.XPATH,'/html/body/div[2]/div/div/button')
cancle.click()

In [5]:
search3 = driver3.find_element(By.XPATH,'//input[@class="_3704LK"]')
search3.send_keys("sunglasses")

In [6]:
icon = driver3.find_element(By.XPATH,'/html/body/div[1]/div/div[1]/div[1]/div[2]/div[2]/form/div/button')
icon.click()

In [7]:
fassured = driver3.find_element(By.XPATH,'//div[@class="_24_Dny _3tCU7L"]')
fassured.click()

In [8]:
brand = []
description = []
price = []

In [9]:
start = 0
end = 3
for page in range(start,end):
    brands = driver3.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in brands[0:100]:
        brands = i.text
        brand.append(brands)
        
for page in range(start,end):
    desc = driver3.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    for i in desc[0:100]:
        descs = i.text
        description.append(descs)
        
        
for page in range(start,end):
    prices = driver3.find_elements(By.XPATH,'//div[@class="_3I9_wc"]')
    for i in prices[0:100]:
        pri = i.text
        price.append(pri)

    
    
    
    
next_page = driver3.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
next_page.click()
time.sleep(4)

df3 = pd.DataFrame({"Brand":brand,"Description":description,"Price":price})
df3

In [10]:
print(len(brand),len(description),len(price))

120 120 120

In [11]:
df3 = pd.DataFrame({"Brand":brand,"Description":description,"Price":price})
df3

              Brand                                        Description   Price
0     VINCENT CHASE  by Lenskart Polarized, UV Protection Retro Squ...  ₹1,999
1     VINCENT CHASE     Polarized, UV Protection Round Sunglasses (51)  ₹1,999
2              SRPM             UV Protection Wayfarer Sunglasses (50)  ₹1,299
3         Elligator  UV Protection Cat-eye, Retro Square, Oval, Rou...    ₹599
4            PIRASO           UV Protection Clubmaster Sunglasses (54)  ₹1,599
..              ...                                                ...     ...
115   VINCENT CHASE                UV Protection Round Sunglasses (47)  ₹1,999
116          PIRASO              UV Protection Aviator Sunglasses (58)  ₹2,599
117       Elligator             UV Protection Wayfarer Sunglasses (53)  ₹1,299
118          SUNBEE  UV Protection, Polarized, Mirrored Retro Squar...  ₹1,299
119  RESIST EYEWEAR  Toughened Glass Lens, UV Protection, Riding Gl...  ₹5,000

[120 rows x 3 columns]

In [12]:
df3[0:100]

            Brand                                        Description   Price
0   VINCENT CHASE  by Lenskart Polarized, UV Protection Retro Squ...  ₹1,999
1   VINCENT CHASE     Polarized, UV Protection Round Sunglasses (51)  ₹1,999
2            SRPM             UV Protection Wayfarer Sunglasses (50)  ₹1,299
3       Elligator  UV Protection Cat-eye, Retro Square, Oval, Rou...    ₹599
4          PIRASO           UV Protection Clubmaster Sunglasses (54)  ₹1,599
..            ...                                                ...     ...
95  VINCENT CHASE  by Lenskart Polarized, UV Protection Wayfarer ...  ₹2,500
96         PIRASO           UV Protection Over-sized Sunglasses (65)  ₹2,599
97         PIRASO             UV Protection Wayfarer Sunglasses (56)  ₹1,599
98       Fastrack      UV Protection Wayfarer Sunglasses (Free Size)  ₹1,099
99  VINCENT CHASE     Polarized, UV Protection Round Sunglasses (50)  ₹1,999

[100 rows x 3 columns]

Q5. Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link:
https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART

In [27]:
#connecting to the web driver
driver4 = webdriver.Chrome(r'chromedriver.exe')

In [28]:
driver4.get(" https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART")

In [29]:
rating = []
review = []
full_review = []

In [30]:
start = 0
end = 10
for pages in range(start,end):
    rate= driver4.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
    for i in rate:
        rts = i.text
        rating.append(rts)
        
        
for pages in range(start,end):
    rev = driver4.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
    for i in rev:
        revs = i.text
        review.append(revs)
        
        
for pages in range(start,end):
    f_rev = driver4.find_elements(By.XPATH,'//div[@class="t-ZTKy"]')
    for i in f_rev:
        f_revs = i.text
        full_review.append(f_revs)
    
    
    
next_button = driver4.find_element(By.XPATH,'/html/body/div/div/div[3]/div/div/div[2]/div[13]/div/div/nav/a[11]')
next_button.click()
time.sleep(4)

In [31]:
print(len(rating),len(review),len(full_review))

100 100 100

In [32]:
flip = pd.DataFrame({"Rating":rating,"review":review,"Full_Review":full_review})

In [33]:
flip

,Rating,review,Full_Review
0,5,Simply awesome,Really satisfied with the Product I received.....
1,5,Perfect product!,Amazing phone with great cameras and better ba...
2,5,Best in the market!,Great iPhone very snappy experience as apple k...
3,4,Value-for-money,I'm Really happy with the product\nDelivery wa...
4,5,Highly recommended,It's my first time to use iOS phone and I am l...
...,...,...,...
95,5,Worth every penny,Previously I was using one plus 3t it was a gr...
96,4,Pretty good,I was using Iphone 6s and also Oneplus 6t. Bot...
97,5,Perfect product!,Value for money\n5 star rating\nExcellent came...
98,5,Highly recommended,What a camera .....just awesome ..you can feel...
99,5,Great product,Amazing Powerful and Durable Gadget.\n\nI’m am...

Q6. Scrape data for first 100 sneakers you find when you visit flipkart.com and search for “sneakers” in thesearch field.
You have to scrape 3 attributes of each sneaker:
    
    1. Brand
    
    2. Product Description
    
    3. Price

In [45]:
driver5 = webdriver.Chrome(r'chromedriver.exe')

In [46]:
driver5.get("https://www.flipkart.com/")

In [47]:
#closeing the login window
close = driver5.find_element(By.XPATH,'/html/body/div[2]/div/div/button')
close.click()

In [48]:
search5 =  driver5.find_element(By.XPATH,'//input[@class="_3704LK"]')
search5.send_keys("sneackers")

In [49]:
fnd = driver5.find_element(By.XPATH,'/html/body/div[1]/div/div[1]/div[1]/div[2]/div[2]/form/div/button')
fnd.click()

In [50]:
fas =  driver5.find_element(By.XPATH,'/html/body/div[1]/div/div[3]/div[1]/div[1]/div/div/div/section[3]/label/div[1]')
fas.click()

In [51]:
sbrand = []
dop = []
price_1 = []

In [52]:
start = 0
end = 3
for pages in range(start,end):
    sb = driver5.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in sb:
        sbrands =  i.text
        sbrand.append(sbrands)
        
        
for pages in range(start,end):
    product = driver5.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    for i in product:
        prd =  i.text
        dop.append(prd)
        
        
        
for pages in range(start,end):
    pr = driver5.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for i in pr:
        prs =  i.text
        price_1.append(prs)
        
        
        
nxt = driver5.find_element(By.XPATH,'/html/body/div[1]/div/div[3]/div/div[2]/div[12]/div/div/nav/a[11]')
nxt.click()
time.sleep(4)

In [53]:
print(len(sbrand),len(dop),len(price_1))

120 120 120

In [54]:
sneackers = pd.DataFrame({"Brand_Name":sbrand,"Product Description":dop,"Price":price_1})

In [56]:
sneackers[0:100]

,Brand_Name,Product Description,Price
0,aadi,Synthetic Leather |Lightweight|Comfort|Summer|...,₹249
1,World Wear Footwear,Latest Exclusive Affordable Collection of Tren...,₹279
2,aadi,Sneakers For Men,₹349
3,SFR,2006 Trenddy Fashion Sporty Casuals Sneakers R...,₹249
4,World Wear Footwear,Latest Exclusive Affordable Collection of Tren...,₹399
...,...,...,...
95,aadi,"Lightweight,Comfort,Summer,Trendy,Walking,Outd...",₹249
96,Lee Won,Sneakers For Men,₹249
97,BRUTON,2 Combo Sneaker Shoes Sneakers For Men,₹399
98,Kraasa,Sneakers For Women,₹299
99,aadi,"Lightweight,Comfort,Summer,Trendy,Walking,Outd...",₹299

Q7. Go to webpage 

https://www.amazon.in/ 
Enter “Laptop” in the search field and then click the search icon. Thenset CPU Type filter to “Intel Core i7”

In [2]:
driver6 = webdriver.Chrome(r'chromedriver.exe')

In [3]:
driver6.get('https://www.amazon.in/')

In [4]:
search6 = driver6.find_element(By.XPATH,'//input[@class="nav-input nav-progressive-attribute"]')
search6.send_keys('Laptop')

In [5]:
srch = driver6.find_element(By.XPATH,'/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input')
srch.click()

In [6]:
cpu = driver6.find_element(By.XPATH,'/html/body/div[1]/div[2]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[6]/span[13]/li/span/a/div/label/i')
cpu.click()

In [7]:
title_name = []
rating6 = []
price6 = []

In [8]:
titles6 = driver6.find_elements(By.XPATH,'//h2[@class="a-size-mini a-spacing-none a-color-base s-line-clamp-2"]')
for i in titles6[0:10]:
    t6 = i.text
    title_name.append(t6)

In [10]:
rate = driver6.find_elements(By.XPATH,'//div[@class="a-row a-size-small"]')
for i in rate[0:10]:
    rt = i.text
    rating6.append(rt)

In [12]:
rs = driver6.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in rs[0:10]:
    prices = i.text
    price6.append(prices)

In [13]:
print(len(title_name),len(rating6),len(price6))

10 10 10

In [14]:
laptop = pd.DataFrame({"Title":title_name,"Ratings":rating6,"Price":price6})

In [15]:
laptop

                                               Title Ratings     Price
0  Lenovo ThinkPad E14 Intel Core i7 12th Gen 14"...      18    98,990
1  ASUS TUF Gaming F15 (2023) 90WHr Battery, Inte...       3  1,15,990
2  Acer Predator Helios Neo 16 Gaming Laptop 13th...       6  1,29,990
3  HP Victus Gaming Latest 12th Gen Intel Core i7...     326    90,990
4  Acer Predator Helios Neo 16 Gaming Laptop 13th...       1  1,49,990
5  HP Pavilion 14 12th Gen Intel Core i7 16GB SDR...     492    84,999
6  HP Pavilion Plus, 12th Gen Intel Core i7 16GB ...     163    93,990
7  Lenovo IdeaPad Slim 5 Intel Core i7 12th Gen 1...      67    79,990
8  ASUS Vivobook S15 OLED 2022, 15.6" 39.62 cms F...      17    84,990
9  ASUS TUF Gaming F15 (2022), 15.6"(39.62 cms) F...      80    93,990

Q8.  Write a python program to scrape data for Top 1000 Quotes of All Time.
The above task will be done in following steps:
1. First get the webpage  https://www.azquotes.com/
2. Click on Top Quote
3. Than scrap a) Quote b) Author c) Type Of Quotes

In [16]:
dr = webdriver.Chrome(r'chromedriver.exe')

In [17]:
dr.get('https://www.azquotes.com/')

In [19]:
top_qt = dr.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a')
top_qt.click()

In [20]:
quote = []
author = []
type_of_qt = []

In [23]:
start = 0
end = 10
for page in range(start,end):
    qt = dr.find_elements(By.XPATH,'//a[@class="title"]')
    for i in qt:
        qts = i.text
        quote.append(qts)
        
        
for page in range(start,end):
    at = dr.find_elements(By.XPATH,'//div[@class="author"]')
    for i in at:
        ats = i.text
        author.append(ats)
        
        
        
for page in range(start,end):
    toq = dr.find_elements(By.XPATH,'//div[@class="tags"]')
    for i in toq:
        toqs = i.text
        type_of_qt.append(toqs)
        
        
nxt_pg = dr.find_element(By.XPATH,'//li[@class="next"]')
nxt_pg.click()
time.sleep(4)

In [24]:
print(len(quote),len(author),len(type_of_qt))

1000 1000 1000

In [25]:
quotes_ds = pd.DataFrame({"Quote":quote,"Auther":author,"type_of_Quote":type_of_qt})

In [26]:
quotes_ds

,Quote,Auther,type_of_Quote
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
995,"When the going gets weird, the weird turn pro.",Hunter S. Thompson,"Music, Sports, Hunting"
996,When a train goes through a tunnel and it gets...,Corrie Ten Boom,"Trust, Encouraging, Uplifting"
997,If you think you are too small to make a diffe...,Dalai Lama,"Inspirational, Funny, Change"
998,"God doesn't require us to succeed, he only req...",Mother Teresa,"Success, God, Mother"
999,Change your thoughts and you change your world.,Norman Vincent Peale,"Inspirational, Motivational, Change"

 Q9. Write a python program to display list of respected former Prime Ministers of India(i.e. Name, Born-Dead,Term of office, Remarks) from https://www.jagranjosh.com/.

In [17]:
dri = webdriver.Chrome(r'chromedriver.exe')

In [18]:
dri.get('https://www.jagranjosh.com/')

In [19]:
gk = dri.find_element(By.XPATH,'/html/body/div[1]/div[1]/div/div[1]/div/div[5]/div/div[1]/header/div[3]/ul/li[3]')
gk.click()

In [21]:
list_fpm = dri.find_element(By.XPATH,'/html/body/div[1]/div/div/div[2]/div/div[10]/div/div/ul/li[2]/a')
list_fpm.click()

In [22]:
name = []
period = []
term_of_office = []
remarks = []

In [7]:
#scraping name 
names = dri.find_elements(By.XPATH,'//div[@class="table-box"]/table/tbody/tr/td[2]/p')
for i in names:
    pm = i.text
    name.append(pm)



#scrping Born-Dead
prd = dri.find_elements(By.XPATH,'//div[@class="table-box"]/table/tbody/tr/td[3]/p')
for i in prd:
    prds = i.text
    period.append(prds)
    
    
#scraping term_of_office    
term = dri.find_elements(By.XPATH,'//div[@class="table-box"]/table/tbody/tr/td[4]/p[1]')
for i in term:
    trm = i.text
    term_of_office.append(trm)
    

#scraping remarks
remark = dri.find_elements(By.XPATH,'//div[@class="table-box"]/table/tbody/tr/td[5]/p')
for i in remark:
    rm = i.text 
    remarks.append(rm)

In [8]:
print(len(name),len(period),len(term_of_office),len(remarks))

19 19 19 19

In [9]:
pm_data = pd.DataFrame({"Name":name,"Born-Dead":period,"Term of office":term_of_office,"Remarks":remarks})

In [10]:
pm_data

,Name,Born-Dead,Term of office,Remarks
0,Jawahar Lal Nehru,(1889–1964),15 August 1947 to 27 May 1964,The first prime minister of India and the long...
1,Gulzarilal Nanda (Acting),(1898-1998),"27 May 1964 to 9 June 1964,",First acting PM of India
2,Lal Bahadur Shastri,(1904–1966),9 June 1964 to 11 January 1966,He has given the slogan of 'Jai Jawan Jai Kisa...
3,Gulzari Lal Nanda (Acting),(1898-1998),11 January 1966 to 24 January 1966,-
4,Indira Gandhi,(1917–1984),24 January 1966 to 24 March 1977,First female Prime Minister of India
5,Morarji Desai,(1896–1995),24 March 1977 to 28 July 1979,Oldest to become PM (81 years old) and first t...
6,Charan Singh,(1902–1987),28 July 1979 to 14 January 1980,Only PM who did not face the Parliament
7,Indira Gandhi,(1917–1984),14 January 1980 to 31 October 1984,The first lady who served as PM for the second...
8,Rajiv Gandhi,(1944–1991),31 October 1984 to 2 December 1989,Youngest to become PM (40 years old)
9,V. P. Singh,(1931–2008),2 December 1989 to 10 November 1990,First PM to step down after a vote of no confi...
10,Chandra Shekhar,(1927–2007),10 November 1990 to 21 June 1991,He belongs to Samajwadi Janata Party
11,P. V. Narasimha Rao,(1921–2004),21 June 1991 to 16 May 1996,First PM from South India
12,Atal Bihari Vajpayee,(1924- 2018),16 May 1996 to 1 June 1996,PM for shortest tenure
13,H. D. Deve Gowda,(born 1933),1 June 1996 to 21 April 1997,He belongs to Janata Dal
14,Inder Kumar Gujral,(1919–2012),21 April 1997 to 19 March 1998,------
15,Atal Bihari Vajpayee,(1924-2018),19 March 1998 to 22 May 2004,The first non-congress PM who completed a ful...
16,Manmohan Singh,(born 1932),22 May 2004 to 26 May 2014,First Sikh PM
17,Narendra Modi,(born 1950),26 May 2014 - 2019,4th Prime Minister of India who served two con...
18,Narendra Modi,(born 1950),30 May 2019- Incumbent,First non-congress PM with two consecutive ten...

Q10. Write a python program to display list of 50 Most expensive cars in the world (i.e.Car name and Price) from https://www.motor1.com/

In [8]:
dcar = webdriver.Chrome(r'chromedriver.exe')

In [9]:
dcar.get("https://www.motor1.com/")

In [10]:
search_car = dcar.find_element(By.XPATH,'//input[@class="m1-search-panel-input m1-search-form-text"]')
search_car.send_keys("50 most expensive cars")

In [11]:
clk_srch =dcar.find_element(By.XPATH,'//button[@class="m1-search-panel-button m1-search-form-button-animate icon-search-svg"]')
clk_srch.click()

In [12]:
expensive = dcar.find_element(By.XPATH,'/html/body/div[3]/div[9]/div/div[1]/div/div/div[2]/div/div[1]/h3/a')
expensive.click()

In [14]:
c_name = []
cname = dcar.find_elements(By.XPATH,'//h3[@class="subheader"]')
for i in cname:
    cn = i.text
    c_name.append(cn)

In [27]:
c_names = c_name[0:50]

In [20]:
c_price = []
for mb in range(4,103,2):
    xpath = f'//div[@class="content-area "]/div[1]/div[2]/div/p[{mb}]'
    element = dcar.find_element(By.XPATH,xpath)
    
    c_price.append(element)

In [23]:
car_prices = []

In [24]:
for i in c_price:
    cn = i.text
    car_prices.append(cn)

In [26]:
print(len(car_prices))

50

In [28]:
print(len(c_names),len(car_prices))

50 50

In [29]:
expensive_cars = pd.DataFrame({"Car_Name":c_names,"Price":car_prices})

In [30]:
expensive_cars

                           Car_Name                        Price
0                     De Tomaso P72          Price: $1.3 Million
1                 Ferrari LaFerrari          Price: $1.4 Million
2                     Pagani Huayra          Price: $1.4 Million
3                      McLaren Elva          Price: $1.7 Million
4                       Czinger 21C          Price: $1.7 Million
5                     Ferrari Monza          Price: $1.7 Million
6                Gordon Murray T.33          Price: $1.7 Million
7                 Koenigsegg Gemera          Price: $1.7 Million
8                       Zenvo TSR-S          Price: $1.7 Million
9                Hennessey Venom F5          Price: $1.8 Million
10                  Bentley Bacalar          Price: $1.9 Million
11    Hispano Suiza Carmen Boulogne          Price: $1.9 Million
12           Bentley Mulliner Batur          Price: $2.0 Million
13                     Deus Vayanne          Price: $2.0 Million
14                      SSC Tuatara         Price: $2.0 Million*
15                      Lotus Evija          Price: $2.1 Million
16              Aston Martin Vulcan          Price: $2.3 Million
17                       Delage D12          Price: $2.3 Million
18                McLaren Speedtail          Price: $2.3 Million
19                     Rimac Nevera          Price: $2.4 Million
20                    Pagani Utopia          Price: $2.5 Million
21             Pininfarina Battista          Price: $2.5 Million
22                Ferrari FXX K Evo          Price: $2.6 Million
23               Gordon Murray T.50          Price: $2.6 Million
24             Lamborghini Countach          Price: $2.6 Million
25         Mercedes-AMG Project One          Price: $2.7 Million
26              Aston Martin Victor          Price: $3.0 Million
27      Hennessey Venom F5 Roadster                 $3.0 Million
28                 Koenigsegg Jesko          Price: $3.0 Million
29            Aston Martin Valkyrie          Price: $3.2 Million
30        W Motors Lykan Hypersport          Price: $3.4 Million
31                    McLaren Solus                 $3.5 Million
32        Pagani Huayra Roadster BC          Price: $3.5 Million
33         Bugatti Chiron Pur Sport          Price: $3.6 Million
34                 Lamborghini Sian          Price: $3.6 million
35                 Koenigsegg CC850          Price: $3.7 Million
36  Bugatti Chiron Super Sport 300+          Price: $3.9 Million
37               Lamborghini Veneno          Price: $4.5 Million
38                   Bugatti Bolide          Price: $4.7 Million
39                  Bugatti Mistral          Price: $5.0 Million
40              Pagani Huayra Imola          Price: $5.4 Million
41                     Bugatti Divo          Price: $5.8 Million
42              SP Automotive Chaos          Price: $6.4 Million
43                 Pagani Codalunga          Price: $7.4 Million
44         Mercedes-Maybach Exelero          Price: $8.0 Million
45               Bugatti Centodieci          Price: $9.0 Million
46          Bugatti Chiron Profilée         Price: $10.8 Million
47             Rolls-Royce Sweptail         Price: $12.8 Million
48         Bugatti La Voiture Noire         Price: $13.4 Million
49           Rolls-Royce Boat Tail*  Price: $28.0 Million (est.)